sdaiIsInstanceOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether an application instance is an instance of a specified type.
\param instance [in] An application instance to be checked.
\param entity   [in] An entity that represents the type.
\returns sdaiTRUE if the application instance is an instance of the specified type; otherwise, the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiED_NDEF - Entity definition not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance ifcWallStandardCase = ...;
SdaiEntity entIfcWall = sdaiGetEntity(model, "ifcWall");
SdaiEntity entIfcWallStandardCase = sdaiGetEntity(model, "ifcWallStandardCase");
SdaiBoolean result1 = sdaiIsInstanceOf(ifcWallStandardCase, entIfcWall); // sdaiFALSE
SdaiBoolean result2 = sdaiIsInstanceOf(ifcWallStandardCase, entIfcWallStandardCase); // sdaiTRUE
SdaiBoolean result3 = sdaiIsKindOf(ifcWallStandardCase, entIfcWall); // sdaiTRUE